annoyedmilk/LogicCard/firmware/ch552_serprog/main.c
    }
}

__idata uint32_t slen;
__idata uint32_t rlen;
__idata int8_t usb_send_length = 0;
__idata uint8_t recv_index = 0;

void usb_send(uint8_t length)
{
    UEP2_T_LEN = length; // Pre-use send length must be cleared
    UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_ACK; // Answer ACK
    UpPoint2_Busy = 1;
}

uint8_t recv_buf_getc()
{
    uint8_t tmp;
    while(USBByteCount == 0);
    tmp = Ep2Buffer[recv_index];
    recv_index++;
    if (recv_index == USBByteCount) {
        recv_index = 0;
        USBByteCount = 0;
        UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_R_RES | UEP_R_RES_ACK;
    }
    return tmp;
}

// FPGA Control Functions
// Based on SLG47910V Table 1. Block Control
// PWR (nRST) EN (nSLEEP) Description
// 0          X           Device Reset/Off State
// 1          0           Lower Power/Retention State
// 1          1           Configuration Mode

void fpga_reset()
{
    // Hold FPGA in reset (PWR=0, EN=X)
    FPGA_RST = 0;  // nRST = 0 (active low)
    FPGA_EN = 0;   // nSLEEP = 0
    mDelaymS(10);  // Hold reset for 10ms
}

void fpga_enable()
{
    // Enable FPGA for configuration (PWR=1, EN=1)
    FPGA_RST = 1;  // nRST = 1 (release reset)
    FPGA_EN = 1;   // nSLEEP = 1 (enable)
    mDelaymS(10);  // Wait for FPGA to start configuration
}

void handle_command()
{
    uint32_t i = 0;
    uint8_t j = 0, k = 0;
    uint8_t c = recv_buf_getc();

    while(UpPoint2_Busy);
    LED = !LED;

    switch(c) {
    case S_CMD_NOP:
        Ep2Buffer[64 + 0] = S_ACK;
        usb_send_length = 1;
        break;

    case S_CMD_Q_IFACE:
        Ep2Buffer[64 + 0] = S_ACK;
        Ep2Buffer[64 + 1] = 0x1;
        Ep2Buffer[64 + 2] = 0x0;
        usb_send_length = 3;
        break;

    case S_CMD_Q_CMDMAP:
        Ep2Buffer[64 + 0] = S_ACK;
        Ep2Buffer[64 + 1] = (CMD_MAP & 0xff);
        Ep2Buffer[64 + 2] = ((CMD_MAP >> 8) & 0xff);
        Ep2Buffer[64 + 3] = ((CMD_MAP >> 16) & 0xff);
        Ep2Buffer[64 + 4] = ((CMD_MAP >> 24) & 0xff);
        for (i = 5; i < 33; i++)
            Ep2Buffer[64 + i] = 0;
        usb_send_length = 33;
        break;

    case S_CMD_Q_PGMNAME:
        Ep2Buffer[64 + 0] = S_ACK;
        while (PGMNAME[i])
        {
            Ep2Buffer[64 + i+1] = PGMNAME[i];
            i++;
        }
        for (; i < 16; i++)
            Ep2Buffer[64 + i+1] = 0;
        usb_send_length = 17;
        break;

    case S_CMD_Q_SERBUF:
        Ep2Buffer[64 + 0] = S_ACK;
        Ep2Buffer[64 + 1] = 0xff;
        Ep2Buffer[64 + 2] = 0xff;
        usb_send_length = 3;
        break;

    case S_CMD_Q_BUSTYPE:
        Ep2Buffer[64 + 0] = S_ACK;
        Ep2Buffer[64 + 1] = BUS_SPI;
        usb_send_length = 2;
        break;

    case S_CMD_SYNCNOP:
        Ep2Buffer[64 + 0] = S_NAK;
        Ep2Buffer[64 + 1] = S_ACK;
        usb_send_length = 2;
        break;

    case S_CMD_S_BUSTYPE:
        if ( (recv_buf_getc()|BUS_SPI) == BUS_SPI)
            Ep2Buffer[64 + 0] = S_ACK;
        else
            Ep2Buffer[64 + 0] = S_NAK;
        usb_send_length = 1;
        break;

    case S_CMD_O_SPIOP:
        Ep2Buffer[64 + 0] = S_ACK;
        usb_send_length = 1;
        usb_send(usb_send_length);
        usb_send_length = 0;
        while(UpPoint2_Busy);

        slen = recv_buf_getc() | ((uint32_t)recv_buf_getc() << 8) | (((uint32_t)recv_buf_getc()) << 16);
        rlen = recv_buf_getc() | ((uint32_t)recv_buf_getc() << 8) | (((uint32_t)recv_buf_getc()) << 16);

        // Reset FPGA before flash operation to allow MCU control of SPI bus
        fpga_reset();
        LED = 0; // Turn on LED during flash operation (active low)

        CS = 0;
        if (slen > 0) {
            for (i = 0; i < slen; i++)
                CH554SPIMasterWrite(recv_buf_getc());
        }
        k = 0;
        if (rlen > 0) {
            UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_R_RES | UEP_R_RES_NAK;       //NAK
            for (i = 0; i < (rlen/64); i++) {
                if ( k == 0 ) {
                    for (j = 64; j < 128; j++) {
                        SPI0_DATA = 0xff;
                        while(S0_FREE == 0);
                        Ep2Buffer[j] = SPI0_DATA;
                    }
                } else {
                    for (j = 64; j < 128; j++) {
                        SPI0_DATA = 0xff;
                        while(S0_FREE == 0);
                        Ep2Buffer_1[j] = SPI0_DATA;
                    }
                }
                while(UpPoint2_Busy);
                if ( k == 0 )
                    UEP2_DMA = (uint16_t) Ep2Buffer;                                                      //Endpoint 2 IN data transfer address
                else
                    UEP2_DMA = (uint16_t) Ep2Buffer_1;                                                      //Endpoint 2 IN data transfer address
                k ^= 0x01;
                usb_send(64);
            }

            k = rlen%64;
            while(UpPoint2_Busy);
            UEP2_DMA = (uint16_t) Ep2Buffer;                                                      //Endpoint 2 IN data transfer address
            for (j = 64; j < k + 64; j++) {
                SPI0_DATA = 0xff;
                while(S0_FREE == 0);
                Ep2Buffer[j] = SPI0_DATA;
            }
            usb_send(k);
            UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_R_RES | UEP_R_RES_ACK;
            while(UpPoint2_Busy);
        }
        CS = 1;

        // Enable FPGA after flash operation completes
        // This allows FPGA to boot from the newly programmed flash
        fpga_enable();
        LED = 1; // Turn off LED after operation completes (active low)
        break;

    default:
        Ep2Buffer[64 + 0] = S_NAK;
        usb_send_length = 1;
        break;
    }

    if (usb_send_length > 0)
        usb_send(usb_send_length);

}

void main()
{
    CfgFsys();
    mDelaymS(5);

    // Configure pin 3.2 as LED control
    P3_DIR_PU |= (1 << LED_PIN);
    P3_MOD_OC &= ~(1 << LED_PIN);

    // Configure pin 3.3 as FPGA_EN control (output)
    P3_DIR_PU |= (1 << FPGA_EN_PIN);
    P3_MOD_OC &= ~(1 << FPGA_EN_PIN);

    // Configure pin 1.0 as FPGA_RST control and SPI CS control (outputs)
    P1_MOD_OC = 0x00 | (1 << 6);
    P1_DIR_PU = 0;
    P1_DIR_PU |= ((1 << FPGA_RST_PIN) | (1 << CS_PIN) | (1 << 5) | (1 << 6) | (1 << 7));

    // Initialize FPGA in enabled state (normal operation)
    FPGA_RST = 1;  // Release reset
    FPGA_EN = 1;   // Enable FPGA

    SPI0_SETUP = 0;                                                       //Master模式,高位在前
    SPI0_CTRL = 0x60;                                                     //模式0
    SPI0_CK_SE = 0x02;

    USBDeviceCfg();
    USBDeviceEndPointCfg();                                               // Endpoint configuration
    USBDeviceIntCfg();                                                    //Interrupt initialization
    UEP0_T_LEN = 0;
    UEP1_T_LEN = 0;                                                       //Pre-use send length must be cleared
    UEP2_T_LEN = 0;                                                       //Pre-use send length must be cleared

    while(!UsbConfig) {
        LED = !LED;
        mDelaymS(50);
    }
    LED = 1; // Turn off LED when USB configured (active low)
    
    while(1)
    {
        handle_command();
        LED = 1; // Turn off LED (active low)
    }
}
